'''
В соответствии с заданием своего варианта доработать программу из ЛР3, использовав класс и обеспечить:
- определение дополнительных параметров
среднее арифметическое элементов последовательности, медиана, мода, дисперсия, СКО последовательности;
- с помощью библиотеки matplotlib нарисовать графики разных цветов в одной координатной оси:
    • график по полученным данным разложения функции в ряд, представленным в таблице, 
    • график соответствующей функции, представленной с помощью модуля math. Обеспечить отображение координатных осей, легенды, текста и аннотации.
'''


